붕빠밬밧타타뺘우차우
빠초아아아아아우우우
우망휴우우우우우우아
아빠밬밧타타뺘우차우
우우우우우우우우우아
아빠밬밧타타뺘우차우
우우우우우우우우우아
아빠밬밧타타뺘우차우
우우우우우우우우우아
아빠밬밧타타뺘우차우
우우우우우우우우우아
아빠밬밧타타뺘우차우
우우우우우우우우우아
아빠밬밧타타뺘우차우
우우우우우우우우우아
아빠밬밧타타뺘우차우
우우우우우우우우우아
아빠밬밧타타뺘우차우
우우우우우우우우우아
아빠밬밧타타뺘우차우
우우우우우우우우우아
우어어어어어어어어어 이제부터 이진변환
빠밧라싹밧나뺘우차우휴 0
오어어어어어어우여어
우서어어어멍석머흑흑
빠밧라싹밧나뺘우차우휴 1
오어어어어어어우여어
우서어어어멍석머흑흑
빠밧라싹밧나뺘우차우휴 2
오어어어어어어우여어
우서어어멍멍석머흑흑 
빠밧라싹밧나뺘우차우휴 3
오어어어어어어우여어
우서어어멍멍석머흑흑
빠밧라싹밧나뺘우차우휴 4
오어어어어어어우여어
우서어멍멍멍석머흑흑
빠밧라싹밧나뺘우차우휴 5
오어어어어어어우여어
우서어멍멍멍석머흑흑
빠밧라싹밧나뺘우차우휴 6
오어어어어어어우여어
우서어멍멍멍석머흑흑
빠밧라싹밧나뺘우차우휴 7
오어어어어어어우여어
우서어멍멍멍석머흑흑
빠밧라싹밧나뺘우차우휴 8
오어어어어어어우여어
우서멍멍멍멍석머흑흑
빠밧라싹밧나뺘우차우휴 9
오어어어어어어우여어
우서멍멍멍멍석머흑흑
빠밧라싹밧나뺘우차우휴 10
오어어어어어어우여어
우서멍멍멍멍석머흑흑
휴~
