#include <stdio.h>
#include <conio.h>
#include <stdlib.h>

int main(void) {
    char board[10][10] = { {'#', '#', '#', '#', '.', '.', '.', '.', '.', '.' },
        {'.', '.', '.', '.', '.', '#', '.', '.', '.', '.' },
        {'#', '#', '#', '.', '#', '.', '.', '.', '.', '.' },
        {'.', '.', '#', '.', '.', '#', '.', '.', '.', '.' },
        {'.', '.', '#', '.', '.', '#', '.', '.', '.', '.' },
        {'.', '.', '#', '.', '.', '#', '.', '.', '.', '.' },
        {'.', '.', '.', '#', '.', '.', '#', '#', '.', '.' },
        {'.', '.', '.', '.', '#', '.', '.', '.', '#', '#' },
        {'.', '.', '.', '.', '.', '#', '.', '.', '.', '.' },
        {'.', '.', '.', '.', '.', '#', '#', '#', '#', '#' } };
    int xpos = 0, ypos = 1;
    board[ypos][xpos] = '@';

    // 사용자로부터 위치를 받아서 보드에 표시한다.
    while (1) {
        system("cls");
        printf("왼쪽이동:<-, 오른쪽 이동:-> 위쪽 이동:^, 아래쪽 이동:V\n");
        for (int y = 0; y < 10; y++) {
            for (int x = 0; x < 10; x++) printf("%c", board[y][x]);
            printf("\n");
        }
        board[ypos][xpos] = '.';
        int ch = _getch();
        if (ch == 224) {
            int ch2 = _getch();
            if (ch2 == 75) xpos--;
            else if (ch2 == 80) ypos++;
            else if (ch2 == 72) ypos--;
            else if (ch2 == 77) xpos++;
        }
        board[ypos][xpos] = '@';
    }
    return 0;
}
